print('Задача 1. Кубы чисел')

# Любителю математики Паше снова стало мало распечатанных табличек,
# включая последнюю со степенями двойки.
# Теперь он хочет взять третью степень чисел от 1 до абсолютно любого!

# Напишите программу,
# которая возводит в третью степень каждое число от 1 до N
# и выводит результат на экран.
N = int(input('Введите число N: '))
count = 0
while count <= N:
  count += 1
  print(f'Число {count} в третьей степени: {count ** 3}')